brew "bat"
brew "difftastic"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "git-delta"
brew "jq"
brew "mise"
brew "neovim"
brew "ripgrep"
brew "tmux"
brew "uv"
brew "chezmoi"

cask "ghostty"
cask "linearmouse"
cask "rectangle"
