[
  [
    "Notepad++",
    "\"The creation of Notepad++ is due to my need for a decent editor to edit the source code\r"
  ],
  [
    "Notepad++ #1",
    "\"I hate reading other people's code.\\nSo I wrote mine, made it as open source project, and watch others suffer.\"\r"
  ],
  [
    "Notepad++ #2",
    "\"Good programmers use Notepad++ to code.\\nExtreme programmers use MS Word to code, in Comic Sans, center aligned.\"\r"
  ],
  [
    "Notepad++ #3",
    "\"The best things in life are free.\\nNotepad++ is free.\\nSo Notepad++ is the best.\\n\"\r"
  ],
  [
    "Richard Stallman",
    "\"If I'm the Father of Open Source, it was conceived through artificial insemination using stolen sperm without my knowledge or consent.\"\r"
  ],
  [
    "Martin Golding",
    "\"Always code as if the guy who ends up maintaining your code will be a violent psychopath who knows where you live.\"\r"
  ],
  ["L. Peter Deutsch", "\"To iterate is human, to recurse divine.\"\r"],
  [
    "Seymour Cray",
    "\"The trouble with programmers is that you can never tell what a programmer is doing until it's too late.\"\r"
  ],
  [
    "Brian Kernighan",
    "\"Debugging is twice as hard as writing the code in the first place. Therefore, if you write the code as cleverly as possible, you are, by definition, not smart enough to debug it.\"\r"
  ],
  [
    "Alan Kay",
    "\"Most software today is very much like an Egyptian pyramid with millions of bricks piled on top of each other, with no structural integrity, but just done by brute force and thousands of slaves.\"\r"
  ],
  [
    "Bill Gates",
    "\"Measuring programming progress by lines of code is like measuring aircraft building progress by weight.\"\r"
  ],
  [
    "Christopher Thompson",
    "\"Sometimes it pays to stay in bed on Monday, rather than spending the rest of the week debugging Monday's code.\"\r"
  ],
  [
    "Vidiu Platon",
    "\"I don't care if it works on your machine! We are not shipping your machine!\"\r"
  ],
  [
    "Edward V Berard",
    "\"Walking on water and developing software from a specification are easy if both are frozen.\"\r"
  ],
  [
    "pixadel",
    "\"Fine, Java MIGHT be a good example of what a programming language should be like.\\nBut Java applications are good examples of what applications SHOULDN'T be like.\"\r"
  ],
  [
    "Oktal",
    "\"I think Microsoft named .Net so it wouldn't show up in a Unix directory listing.\"\r"
  ],
  [
    "Bjarne Stroustrup",
    "\"In C++ it's harder to shoot yourself in the foot, but when you do, you blow off your whole leg.\"\r"
  ],
  [
    "Mosher's Law of Software Engineering",
    "\"Don't worry if it doesn't work right. If everything did, you'd be out of a job.\"\r"
  ],
  [
    "Bob Gray",
    "\"Writing in C or C++ is like running a chain saw with all the safety guards removed.\"\r"
  ],
  [
    "Roberto Waltman",
    "\"In the one and only true way. The object-oriented version of \\\"Spaghetti code\\\" is, of course, \\\"Lasagna code\\\". (Too many layers)\"\r"
  ],
  [
    "Gavin Russell Baker",
    "\"C++ : Where friends have access to your private members.\"\r"
  ],
  ["Linus Torvalds", "\"Software is like sex: It's better when it's free.\"\r"],
  [
    "Cult of vi",
    "\"Emacs is a great operating system, lacking only a decent editor.\"\r"
  ],
  [
    "Church of Emacs",
    "\"vi has two modes - \\\"beep repeatedly\\\" and \\\"break everything\\\".\"\r"
  ],
  [
    "Steve Jobs",
    "\"Picasso had a saying: \\\"Good artists copy, great artists steal.\\\".\\nWe have always been shameless about stealing great ideas.\"\r"
  ],
  [
    "brotips #1001",
    "\"Do everything for greatness, not money. Money follows greatness.\"\r"
  ],
  [
    "Robin Williams",
    "\"God gave men both a penis and a brain, but unfortunately not enough blood supply to run both at the same time.\"\r"
  ],
  [
    "Darth Vader",
    "\"Strong people don't put others down.\\nThey lift them up.\"\r"
  ],
  [
    "Darth Vader #2",
    "\"You don't get to 500 million star systems without making a few enemies.\"\r"
  ],
  [
    "Doug Linder",
    "\"A good programmer is someone who always looks both ways before crossing a one-way street.\"\r"
  ],
  [
    "Jean-Claude van Damme",
    "\"A cookie has no soul, it's just a cookie. But before it was milk and eggs.\\nAnd in eggs there's the potential for life.\"\r"
  ],
  ["Michael Feldman", "\"Java is, in many ways, C++--.\"\r"],
  ["Don Ho", "\"Je mange donc je chie.\"\r"],
  [
    "Don Ho #2",
    "\"RTFM is the true path of every developer.\\nBut it would happen only if there's no way out.\"\r"
  ],
  [
    "Don Ho #3",
    "\"Smartphone is the best invention of 21st century for avoiding the eyes contact while crossing people you know on the street.\"\r"
  ],
  [
    "Don Ho #4",
    "\"Poor countries' museums vs. rich countries' museums:\\nThe first show what they have left.\\nThe second show what they have stolen.\"\r"
  ],
  ["Anonymous #1", "\"An opinion without 3.14 is just an onion.\"\r"],
  [
    "Anonymous #2",
    "\"Before sex, you help each other get naked, after sex you only dress yourself.\\nMoral of the story: in life no one helps you once you're fucked.\"\r"
  ],
  [
    "Anonymous #3",
    "\"I'm not totally useless. I can be used as a bad example.\"\r"
  ],
  ["Anonymous #4", "\"Life is too short to remove USB safely.\"\r"],
  [
    "Anonymous #5",
    "\"\\\"SEX\\\" is not the answer.\\nSex is the question, \\\"YES\\\" is the answer.\"\r"
  ],
  [
    "Anonymous #6",
    "\"Going to McDonald's for a salad is like going to a whore for a hug.\"\r"
  ],
  ["Anonymous #7", "\"I need a six month holiday, TWICE A YEAR!\"\r"],
  ["Anonymous #8", "\"Everything is a knife if you're strong enough.\"\r"],
  [
    "Anonymous #9",
    "\"I'M A FUCKING ANIMAL IN BED.\\nMore specifically a koala.\"\r"
  ],
  ["Anonymous #10", "\"Etc.\\n\\n(Abb.) End of Thinking Capacity.\\n\"\r"],
  [
    "Anonymous #11",
    "\"We stopped checking for monsters under our bed, when we realized they were inside us.\"\r"
  ],
  [
    "Anonymous #12",
    "\"I would rather check my facebook than face my checkbook.\"\r"
  ],
  [
    "Anonymous #13",
    "\"Whoever says Paper beats Rock is an idiot. Next time I see someone say that I will throw a rock at them while they hold up a sheet of paper.\"\r"
  ],
  [
    "Anonymous #14",
    "\"A better world is where chickens can cross the road without having their motives questioned.\"\r"
  ],
  [
    "Anonymous #15",
    "\"If I didn't drink, how would my friends know I love them at 2 AM?\"\r"
  ],
  [
    "Anonymous #16",
    "\"Q: How do you generate a random string?\\nA: Put a Windows user in front of vi, and tell him to exit.\"\r"
  ],
  [
    "Anonymous #17",
    "\"Pros and cons of making food.\\nPros: food\\nCons : making\\n\"\r"
  ],
  [
    "Anonymous #18",
    "\"Never get into fights with ugly people, they have nothing to lose.\"\r"
  ],
  [
    "Anonymous #19",
    "\"People who say they give 110%\\ndon't really understand how percentages work.\"\r"
  ],
  ["Anonymous #20", "\"Never make eye contact while eating a banana.\"\r"],
  [
    "Anonymous #21",
    "\"I love my sixpack so much, I protect it with a layer of fat.\"\r"
  ],
  [
    "Anonymous #22",
    "\"\\\"It's impossible.\\\" said pride.\\n\\\"It's risky.\\\" said experience.\\n\\\"It's pointless.\\\" said reason.\\n\\\"Give it a try.\\\" whispered the heart.\\n...\\n\\\"What the hell was that?!?!?!?!?!\\\" shouted the anus two minutes later.\"\r"
  ],
  [
    "Anonymous #23",
    "\"A programmer is told to \\\"go to hell\\\".\\nHe finds the worst part of that statement is the \\\"go to\\\".\"\r"
  ],
  ["Anonymous #24", "\"An Architect's dream is an Engineer's nightmare.\"\r"],
  [
    "Anonymous #25",
    "\"In a way, I feel sorry for the kids of this generation.\\nThey'll have parents who know how to check browser history.\"\r"
  ],
  [
    "Anonymous #26",
    "\"Q: What's the difference between git and github?\\nA: It's the difference between porn and pornhub.\\n\"\r"
  ],
  [
    "Anonymous #27",
    "\"I don't have a problem with caffeine.\\nI have a problem without caffeine.\"\r"
  ],
  [
    "Anonymous #28",
    "\"Why 6 afraid of 7?\\nBecause 7 8 9 while 6 and 9 were flirting.\"\r"
  ],
  [
    "Anonymous #29",
    "\"How do you comfort a JavaScript bug?\\nYou console it.\"\r"
  ],
  [
    "Anonymous #30",
    "\"Why do Java developers wear glasses?\\nBecause they don't C#.\"\r"
  ],
  [
    "Anonymous #31",
    "\"A baby's laughter is one of the most beautiful sounds you will ever hear. Unless it's 3 AM. And you're home alone. And you don't have a baby.\"\r"
  ],
  [
    "Anonymous #32",
    "\"Two bytes meet. The first byte asks, \\\"You look terrible. Are you OK?\\\"\\nThe second byte replies, \\\"No, just feeling a bit off.\\\"\"\r"
  ],
  [
    "Anonymous #33",
    "\"Programmer - an organism that turns coffee into software.\"\r"
  ],
  ["Anonymous #34", "\"It's not a bug - it's an undocumented feature.\"\r"],
  [
    "Anonymous #35",
    "\"Should array index start at 0 or 1?\\nMy compromised solution is 0.5\"\r"
  ],
  [
    "Anonymous #36",
    "\"Every single time when I'm about to hug someone extremely sexy, I hit the mirror.\"\r"
  ],
  [
    "Anonymous #37",
    "\"My software never has bugs. It just develops random features.\"\r"
  ],
  ["Anonymous #38", "\"LISP = Lots of Irritating Silly Parentheses.\"\r"],
  [
    "Anonymous #39",
    "\"Perl, the only language that looks the same before and after RSA encryption.\"\r"
  ],
  [
    "Anonymous #40",
    "\"People ask me why, as an atheist, I still say: OH MY GOD.\\nIt makes perfect sense: We say \\\"Oh my God\\\" when something is UNBELIEVABLE.\"\r"
  ],
  [
    "Anonymous #41",
    "\"1. Dig a hole.\\n2. Name it love.\\n3. Watch people falling in love.\\n\"\r"
  ],
  [
    "Anonymous #42",
    "\"Don't think of yourself as an ugly person.\\nThink of yourself as a beautiful monkey.\"\r"
  ],
  ["Anonymous #43", "\"Afraid to die alone?\\nBecome a bus driver.\"\r"],
  [
    "Anonymous #44",
    "\"The first 5 days after the weekend are always the hardest.\"\r"
  ],
  ["Anonymous #45", "\"Rhinos are just fat unicorns.\"\r"],
  [
    "Anonymous #46",
    "\"Sometimes when I'm writing Javascript I want to throw up my hands and say \\\"this is bullshit!\\\"\\nbut I can never remember what \\\"this\\\" refers to.\"\r"
  ],
  ["Anonymous #47", "\"Kids are like farts.\\nYou can only stand yours.\"\r"],
  [
    "Anonymous #48",
    "\"If you were born in Israel, you'd probably be Jewish.\\nIf you were born in Saudi Arabia, you'd probably be Muslim.\\nIf you were born in India, you'd probably be Hindu.\\nBut because you were born in North America, you're Christian.\\nYour faith is not inspired by some divine, constant truth.\\nIt's simply geography.\"\r"
  ],
  [
    "Anonymous #49",
    "\"There are 2 types of people in this world:\\nPeople who say they pee in the shower, and the dirty fucking liars.\"\r"
  ],
  [
    "Anonymous #50",
    "\"London 2012 Olympic Games - A bunch of countries coming across the ocean to put their flags in Britain and try to get a bunch of gold... it's like history but opposite.\"\r"
  ],
  [
    "Anonymous #51",
    "\"I don't need a stable relationship,\\nI just need a stable Internet connection.\"\r"
  ],
  [
    "Anonymous #52",
    "\"What's the difference between religion and bullshit?\\nThe bull.\"\r"
  ],
  [
    "Anonymous #53",
    "\"Today, as I was waiting for my girlfriend in the street, I saw a woman who looked a lot like her. I ran towards her, my arms in the air ready to give her a hug, only to realise it wasn't her. I then had to pass the woman, my arms in the air, still running. FML\"\r"
  ],
  [
    "Anonymous #54",
    "\"Decimal: 1 + 1 = 2\\nBinary:  1 + 1 = 10\\nBoolean: 1 + 1 = 1\\nJavaScript(hold my beer) : 1 + 1 = 11\\n\"\r"
  ],
  [
    "Anonymous #55",
    "\"Don't be ashamed of who you are.\\nThat's your parents job.\"\r"
  ],
  [
    "Anonymous #56",
    "\"Religion is like circumcision.\\nIf you wait until someone is 21 to tell them about it they probably won't be interested.\"\r"
  ],
  [
    "Anonymous #57",
    "\"No, no, no, I'm not insulting you.\\nI'm describing you.\"\r"
  ],
  [
    "Anonymous #58",
    "\"I bought a dog once. Named him \\\"Stay\\\".\\n\\\"Come here, Stay.\\\"\\nHe's insane now.\"\r"
  ],
  [
    "Anonymous #59",
    "\"Law of Software Quality:\\n\terrors = (more code)²\\ne = mc²\"\r"
  ],
  [
    "Anonymous #60",
    "\"Yesterday I named my Wifi network \\\"hack me if you can\\\"\\nToday when I woke up it was changed to \\\"challenge accepted\\\".\"\r"
  ],
  [
    "Anonymous #61",
    "\"Your mother is so fat,\\nthe recursive function computing her mass causes a stack overflow.\"\r"
  ],
  [
    "Anonymous #62",
    "\"Oral sex makes my day, but anal sex makes my hole weak.\"\r"
  ],
  [
    "Anonymous #63",
    "\"I'm not saying I am Batman, I am just saying no one has ever seen me and Batman in the same room together.\"\r"
  ],
  [
    "Anonymous #64",
    "\"I took a taxi today.\\nThe driver told me \\\"I love my job, I own this car, I've got my own business, I'm my own boss, NO ONE tells me what to do!\\\"\\nI said \\\"TURN LEFT HERE\\\".\\n\"\r"
  ],
  [
    "Anonymous #65",
    "\"A man without God is like a fish without a bicycle.\"\r"
  ],
  [
    "Anonymous #66",
    "\"I hate how spiders just sit there on the walls and act like they pay rent!\"\r"
  ],
  [
    "Anonymous #67",
    "\"Whenever someone starts a sentence by saying \\\"I'm not racist...\\\"),they are about to say something super racist.\"\r"
  ],
  [
    "Anonymous #68",
    "\"I'm not laughing at you, I'm laughing with you, you're just not laughing.\\n\"\r"
  ],
  [
    "Anonymous #69",
    "\"Women need a reason to have sex. Men just need a place.\"\r"
  ],
  ["Anonymous #70", "\"If abortion is murder then are condoms kidnapping?\"\r"],
  [
    "Anonymous #71",
    "\"Men also have feelings.\\nFor example, they can feel hungry.\"\r"
  ],
  [
    "Anonymous #72",
    "\"Project Manager:\\nA person who thinks 9 women can deliver a baby in 1 month.\"\r"
  ],
  [
    "Anonymous #73",
    "\"If you try and don't succeed, cheat. Repeat until caught. Then lie.\"\r"
  ],
  [
    "Anonymous #74",
    "\"Olympics is the stupidest thing.\\nPeople are so proud to be competing for their country.\\nThey play their stupid song and raise some dumb flags.\\nI'd love to see no flags raised, no song, no mention of country.\\nOnly people.\"\r"
  ],
  ["Anonymous #75", "\"I think therefore I am\\nnot religious.\"\r"],
  [
    "Anonymous #76",
    "\"Even if being gay were a choice, so what?\\nPeople choose to be assholes and they can get married.\"\r"
  ],
  [
    "Anonymous #77",
    "\"Governments are like diapers.\\nThey should be changed often, and for the same reason.\"\r"
  ],
  [
    "Anonymous #78",
    "\"Mathématiquement, un cocu est un entier qui partage sa moitié avec un tiers.\\n\"\r"
  ],
  ["Anonymous #79", "\"I'm a creationist.\\nI believe man created God.\\n\"\r"],
  [
    "Anonymous #80",
    "\"Let's eat kids.\\nLet's eat, kids.\\n\\nUse a comma.\\nSave lives.\\n\"\r"
  ],
  [
    "Anonymous #81",
    "\"A male engineering student was crossing a road one day when a frog called out to him and said, \\\"If you kiss me, I'll turn into a beautiful princess.\\\" He bent over, picked up the frog, and put it in his pocket.\\n\\nThe frog spoke up again and said, \\\"If you kiss me and turn me back into a beautiful princess, I will stay with you for one week.\\\" The engineering student took the frog out of his pocket, smiled at it; and returned it to his pocket.\\n\\nThe frog then cried out, \\\"If you kiss me and turn me back into a princess, I'll stay with you and do ANYTHING you want.\\\" Again the boy took the frog out, smiled at it, and put it back into his pocket.\\n\\nFinally, the frog asked, \\\"What is the matter? I've told you I'm a beautiful princess, that I'll stay with you for a week and do anything you want. Why won't you kiss me?\\\" The boy said, \\\"Look I'm an engineer. I don't have time for a girlfriend, but a talking frog is cool.\\\"\\n\"\r"
  ],
  ["Anonymous #82", "\"Gamers never die.\\nThey just go offline.\\n\"\r"],
  [
    "Anonymous #83",
    "\"Copy from one, it's plagiarism.\\nCopy from two, it's research.\\n\"\r"
  ],
  [
    "Anonymous #84",
    "\"Saying that Java is nice because it works on all OSes is like saying that anal sex is nice because it works on all genders.\"\r"
  ],
  [
    "Anonymous #85",
    "\"Race, religion, ethnic pride and nationalism etc... does nothing but teach you how to hate people that you've never met.\"\r"
  ],
  ["Anonymous #86", "\"Farts are just the ghosts of the things we eat.\"\r"],
  [
    "Anonymous #87",
    "\"I promised I would never kill someone who had my blood.\\nBut that mosquito made me break my word.\"\r"
  ],
  [
    "Anonymous #88",
    "\"Si un jour une chaise te dit que t'as un joli cul, tu trouveras ça bizarre mais c'est juste un compliment d'objet direct.\"\r"
  ],
  [
    "Anonymous #89",
    "\"The biggest step in any relationship isn't the first kiss.\\nIt's the first fart.\"\r"
  ],
  [
    "Anonymous #90",
    "\"Clapping:\\n(verb)\\nRepeatedly high-fiving yourself for someone else's accomplishments.\"\r"
  ],
  ["Anonymous #91", "\"CV: ctrl-C, ctrl-V\"\r"],
  [
    "Anonymous #92",
    "\"Mondays are not so bad.\\nIt's your job that sucks.\"\r"
  ],
  [
    "Anonymous #93",
    "\"[In a job interview]\\nInterviewer: What's your greatest weakness?\\nCandidate: Honesty.\\nInterviewer: I don't think honesty is a weakness.\\nCandidate: I don't give a fuck what you think.\"\r"
  ],
  [
    "Anonymous #94",
    "\"Hey, I just met you\\nAnd this is crazy\\nHere's my number 127.0.0.1\\nPing me maybe?\"\r"
  ],
  [
    "Anonymous #95",
    "\"What if the spider you killed in your house had spent his entire life thinking you were his roommate?\\nEver think about that?\\nNo. You only think about yourself.\\n\"\r"
  ],
  ["Anonymous #96", "\"Code for 6 minutes, debug for 6 hours.\"\r"],
  [
    "Anonymous #97",
    "\"Real Programmers don't comment their code.\\nIf it was hard to write, it should be hard to read.\"\r"
  ],
  [
    "Anonymous #98",
    "\"My neighbours listen to good music.\\nWhether they like it or not.\"\r"
  ],
  [
    "Anonymous #99",
    "\"I've been using Vim for about 2 years now,\\nmostly because I can't figure out how to exit it.\"\r"
  ],
  [
    "Anonymous #100",
    "\"Dear YouTube,\\nI can deal with Ads.\\nI can deal with Buffer.\\nBut when Ads buffer, I suffer.\"\r"
  ],
  [
    "Anonymous #101",
    "\"It's always sad when a man and his dick share only one brain...\\nand it turns out to be the dick's.\"\r"
  ],
  [
    "Anonymous #102",
    "\"If IE is brave enough to ask you to set it as your default browser,\\ndon't tell me you dare not ask a girl out.\"\r"
  ],
  [
    "Anonymous #104",
    "\"The main idea of \\\"Inception\\\":\\nif you run a VM inside a VM inside a VM inside a VM inside a VM,\\neverything will be very slow.\"\r"
  ],
  ["Anonymous #105", "\"The best antivirus is common sense.\"\r"],
  [
    "Anonymous #106",
    "\"When I die, I want to go peacefully like my grandfather did, in his sleep\\n- not screaming, like the passengers in his car.\"\r"
  ],
  [
    "Anonymous #107",
    "\"Remember, YOUR God is real.\\nAll those other Gods are ridiculous, made-up nonsense.\\nBut not yours.\\nYour God is real. Whichever one that is.\"\r"
  ],
  [
    "Anonymous #109",
    "\"What's the best thing about UDP jokes?\\nI don't care if you get them.\"\r"
  ],
  [
    "Anonymous #110",
    "\"A programmer had a problem, so he decided to use threads.\\nNow 2 has. He problems\"\r"
  ],
  [
    "Anonymous #111",
    "\"I'VE NEVER BEEN VERY GOOD AT GEOGRAPHY.\\nBUT I CAN NAME AT LEAST ONE CITY IN FRANCE, WHICH IS NICE.\"\r"
  ],
  [
    "Anonymous #113",
    "\"A colon can completely change the meaning of a sentence. For example:\\n- Jane ate her friend's sandwich.\\n- Jane ate her friend's colon.\"\r"
  ],
  [
    "Anonymous #114",
    "\"How can you face your problem if your problem is your face?\"\r"
  ],
  ["Anonymous #115", "\"YOLOLO:\\nYou Only LOL Once.\"\r"],
  ["Anonymous #116", "\"Every exit is an entrance to new experiences.\"\r"],
  [
    "Anonymous #117",
    "\"A Native American was asked:\\n\\\"Do you celebrate Columbus day?\\\"\\nHe replied:\\n\\\"I don't know, do Jews celebrate Hitler's birthday?\\\"\"\r"
  ],
  [
    "Anonymous #118",
    "\"I love necrophilia, but i can't stand the awkward silences.\"\r"
  ],
  [
    "Anonymous #119",
    "\"\\\"I'm gonna Google that. BING that, Bing that, sorry.\\\"\\n- The CEO of Bing (many times per day still)\"\r"
  ],
  [
    "Anonymous #120",
    "\"GRAMMAR\\nThe difference between knowing your shit and knowing you're shit.\"\r"
  ],
  [
    "Anonymous #121",
    "\"5 out of 6 people agree that Russian roulette is completely safe.\"\r"
  ],
  [
    "Anonymous #122",
    "\"Nerd?\\nI prefer the term \\\"Intellectual badass\\\".\"\r"
  ],
  [
    "Anonymous #123",
    "\"I know every digit of π,\\njust not in the right order.\"\r"
  ],
  [
    "Anonymous #124",
    "\"You don't need religion to have morals.\\nIf you can't determine right from wrong then you lack empathy, not religion.\"\r"
  ],
  [
    "Anonymous #125",
    "\"Pooping with the door opened is the meaning of true freedom.\"\r"
  ],
  [
    "Anonymous #126",
    "\"Social media does not make people stupid.\\nIt just makes stupid people more visible.\"\r"
  ],
  [
    "Anonymous #128",
    "\"3 men are on a boat. They have 4 cigarettes, but nothing to light them with.\\nSo they throw a cigarette overboard and the whole boat becomes a cigarette lighter.\"\r"
  ],
  [
    "Anonymous #129",
    "\"What is the most used language in programming?\\n\\nProfanity\\n\"\r"
  ],
  [
    "Anonymous #130",
    "\"Common sense is so rare, it's kinda like a superpower...\"\r"
  ],
  [
    "Anonymous #131",
    "\"The best thing about a boolean is even if you are wrong, you are only off by a bit.\"\r"
  ],
  ["Anonymous #132", "\"Benchmarks don't lie, but liars do benchmarks.\"\r"],
  ["Anonymous #133", "\"Multitasking: Screwing up several things at once.\"\r"],
  [
    "Anonymous #134",
    "\"Linux is user friendly.\\nIt's just picky about its friends.\"\r"
  ],
  [
    "Anonymous #135",
    "\"Theory is when you know something, but it doesn't work.\\nPractice is when something works, but you don't know why.\\nProgrammers combine theory and practice: nothing works and they don't know why.\"\r"
  ],
  [
    "Anonymous #136",
    "\"Documentation is like sex:\\nwhen it's good, it's very, very good;\\nwhen it's bad, it's better than nothing.\"\r"
  ],
  ["Anonymous #137", "\"Home is where you poop most comfortably.\"\r"],
  [
    "Anonymous #138",
    "\"Laptop Speakers problem: too quiet for music, too loud for porn.\"\r"
  ],
  [
    "Anonymous #139",
    "\"Chinese food to go: $16\\nGas to go get the food: $2\\nDrove home just to realize they forgot one of your containers: RICELESS\"\r"
  ],
  [
    "Anonymous #140",
    "\"MS Windows is like religion to most people: they are born into it, accept it as default, never consider switching to another.\"\r"
  ],
  [
    "Anonymous #141",
    "\"To most religious people, the holy books are like a software license (EULA).\\nNobody actually reads it. They just scroll to the bottom and click \\\"I agree\\\".\"\r"
  ],
  [
    "Anonymous #142",
    "\"You are nothing but a number of days,\\nwhenever each day passes then part of you has gone.\"\r"
  ],
  [
    "Anonymous #143",
    "\"If 666 is evil, does that make 25.8069758011 the root of all evil?\"\r"
  ],
  [
    "Anonymous #144",
    "\"I don't want to sound like a badass but\\nI eject my USB drive without removing it safely.\"\r"
  ],
  [
    "Anonymous #145",
    "\"feet  (noun)\\na device used for finding legos in the dark\"\r"
  ],
  [
    "Anonymous #146",
    "\"Buy a sheep\\nName it \\\"Relation\\\"\\nNow you have a Relationsheep\\n\"\r"
  ],
  [
    "Anonymous #147",
    "\"I dig, you dig, we dig,\\nhe dig, she dig, they dig...\\n\\nIt's not a beautiful poem,\\nbut it's very deep.\"\r"
  ],
  [
    "Anonymous #149",
    "\"unzip, strip, top, less, touch, finger, grep, mount, fsck, more, yes, fsck, fsck, fsck, umount, sleep.\\n\\nNo, it's not porn. It's Unix.\"\r"
  ],
  [
    "Anonymous #150",
    "\"To understand what recursion is, you must first understand recursion.\"\r"
  ],
  [
    "Anonymous #151",
    "\"Q: What's the object-oriented way to become wealthy?\\nA: Inheritance.\"\r"
  ],
  [
    "Anonymous #152",
    "\"A SQL query goes into a bar, walks up to two tables and asks, \\\"Can I join you?\\\"\"\r"
  ],
  ["Anonymous #153", "\"You are not fat, you are just more visible.\"\r"],
  [
    "Anonymous #154",
    "\"Minimalist\\n (.   .)\\n  )   (\\n (  Y  )\\nASCII Art\"\r"
  ],
  [
    "Anonymous #155",
    "\"Parallel lines have so much in common...\\nIt's a shame that they'll never meet.\"\r"
  ],
  [
    "Anonymous #156",
    "\"Declare variables, not war.\\nExecute programs, not people.\"\r"
  ],
  [
    "Anonymous #157",
    "\"I can't see an end. I have no control and I don't think there's any escape. I don't even have a home anymore.\\nI think it's time for a new keyboard.\"\r"
  ],
  ["Anonymous #158", "\"6.9\\nA little fun interrupted by a period.\"\r"],
  [
    "Anonymous #159",
    "\"I love anal\\n-yzing all data before making assumptions.\"\r"
  ],
  [
    "Anonymous #160",
    "\"So my wife said\\n\\\"take off my shirt\\\".\\nI did as she said and take off her shirt.\\nThen she said,\\n\\\"Take off my skirt.\\\"\\nI took off her skirt.\\n\\\"Take off my shoes.\\\"\\nI took off her shoes.\\n\\\"Now take off my bra and panties.\\\"\\nand so I took them off.\\nThen she looked at me and said\\n\\\"I don't want to catch you wearing my things ever again.\\\"\"\r"
  ],
  [
    "Anonymous #161",
    "\"Do you know:\\nSpiders are the only web developers in the world that enjoy finding bugs.\")\r"
  ],
  [
    "Anonymous #162",
    "\"Psychologist: Lie down please.\\n8: No, thank you. If I do, this session will never reach the end.\")\r"
  ],
  [
    "Anonymous #163",
    "\"I love the way the earth rotates,\\nit really makes my day.\")\r"
  ],
  ["Anonymous #164", "\"Homonyms are a waist of thyme.\")\r"],
  [
    "Anonymous #165",
    "\"What's the difference between a police officer and a bullet?\\nWhen a bullet kills someone else, you know it's been fired.\")\r"
  ],
  [
    "Anonymous #166",
    "\"What has 4 letters\\nsometimes 9 letters\\nbut never has 5 letters\")\r"
  ],
  [
    "Anonymous #167",
    "\"The 'h' in \\\"software development\\\" stands for \\\"happiness\\\".\")\r"
  ],
  [
    "Anonymous #168",
    "\"Never let your computer know that you are in a hurry.\\nComputers can smell fear.\\nThey slow down if they know that you are running out of time.\")\r"
  ],
  [
    "Anonymous #169",
    "\"JavaScript is not a language.\\nIt's a programming jokes generator.\")\r"
  ],
  [
    "Anonymous #170",
    "\"A journalist asked Linus Torvalds what makes code bad.\\nHe replied : No comment.\")\r"
  ],
  [
    "Anonymous #171",
    "\"If you spell \\\"Nothing\\\" backwards, it becomes \\\"Gnihton\\\" which also means nothing.\")\r"
  ],
  [
    "Anonymous #172",
    "\"Programming in Javascript is like looking both ways before you cross the street, and then getting hit by an airplane.\")\r"
  ],
  [
    "Anonymous #173",
    "\"Q: Why do we need a backend, why not just connect front end to database???\\n\\nA: Yeah! And why do we eat and go to the bathroom while we can throw the food directly in the toilet? Because stuff needs to get processed. ;)\\n\")\r"
  ],
  [
    "Anonymous #174",
    "\"Someday, once humans are extinct from covid-19. I hope whatever species rules Earth makes chicken nuggets in the shape of us, like we did for dinosaurs.\")\r"
  ],
  [
    "Anonymous #175",
    "\"Linkedin is basically a reversed Tinder.\\nHot girls write to nerd guys and they didn't reply.\")\r"
  ],
  [
    "Anonymous #176",
    "\"A vegan said to me, \\\"people who sell meat are gross!\\\"\\nI said, \\\"people who sell fruits and vegetables are grocer.\\\"\\n\")\r"
  ],
  [
    "Anonymous #177",
    "\"Documentation is a love letter that you write to your future self.\\n\")\r"
  ],
  [
    "Anonymous #178",
    "\"When I die, I hope it's early in the morning so I don't have to go to work that day for no reason.\\n\")\r"
  ],
  [
    "Anonymous #179",
    "\"Workers plaay football\\nManagers play tennis\\nCEOs play golf\\n\\nHigher the function, smaller the balls.\\n\")\r"
  ],
  [
    "Anonymous #180",
    "\"Friends are just like trees.\\nThey fall down when you hit them multiple times with an axe.\\n\")\r"
  ],
  [
    "Anonymous #181",
    "\"I met a magical Genie. He gave me one wish.\\nI said: \\\"I wish I could be you.\\\"\\nThe Genue saud: \\\"Weurd wush but U wull grant ut.\\\"\\n\")\r"
  ],
  [
    "Anonymous #183",
    "\"Dear Optimist, Pessimist and Realist,\\n\\nWhile you guys were busy arguing about\\nthe glass of water, I drank it!\\n\\n\\n\t\t\t\t\tSincerely,\\n\t\t\t\t\tThe Opportunist\\n\")\r"
  ],
  [
    "Anonymous #184",
    "\"Dance like nobody's watching.\\nEncrypt like everyone is.\\n\")\r"
  ],
  [
    "Anonymous #185",
    "\"Me: \\\"I'm 45 years old but I've got a 19 year-old young man's body\\\"\\nHer: \\\"Show me\\\"\\nI opened the freezer to show her the body.\\nShe screamed.\\nMe too.\\n\")\r"
  ],
  [
    "Anonymous #186",
    "\"Everyone complains about the weather,\\nbut no one wants to sacrifice a virgin to change it.\\n\")\r"
  ],
  [
    "Anonymous #187",
    "\"If you are alone at home and feel lonely:\\nTurn off the lights, turn on the TV and watch a horror movie.\\nThen you will have feeling that there are someone hidden in the kitchen, in the toilet\\nand even under your bed.\\n\")\r"
  ],
  [
    "Anonymous #188",
    "\"*Knock knock*\\n\\\"Race condition\\\"\\n\\\"Who's there?\\\"\\n\")\r"
  ],
  [
    "Anonymous #189",
    "\"The two most difficult programming challenges are naming things, cache invalidation, and off-by-one errors.\\n\")\r"
  ],
  [
    "Anonymous #190",
    "\"The greatest security vulnerability in any computer system is located between the keyboard and the chair.\\n\")\r"
  ],
  [
    "Anonymous #191",
    "\"My biggest talent is always being able to tell what's in a wrapped present.\\n\\nIt's a gift.\\n\")\r"
  ],
  [
    "Anonymous #192",
    "\"You can't force someone to love you.\\nBut you can lock this person in the basement and wait for him/her to develop Stockholm syndrome.\\n\")\r"
  ],
  [
    "Anonymous #193",
    "\"Do you know:\\nthere are more airplanes in the oceans, than submarines in the sky?\\n\")\r"
  ],
  [
    "Anonymous #194",
    "\"If you hold a Unix shell up to your ear,\\nyou might just be able to hear the C.\\n\")\r"
  ],
  [
    "Anonymous #195",
    "\"Why do programmers always mix up Halloween and Christmas?\\nBecause Oct 31 == Dec 25\\n\")\r"
  ],
  [
    "Anonymous #196",
    "\"What happened to the function that ran away?\\nIt never returned.\\n\")\r"
  ],
  [
    "Anonymous #197",
    "\"When I am tasked with sorting through a stack of résumés, I throw about half of them in the garbage.\\nI do not want unlucky people working in our company.\\n\")\r"
  ],
  [
    "Anonymous #198",
    "\"The reason why we write SQL commands all in CAPITAL letters is because it stands for Screaming Query Language.\\n\")\r"
  ],
  [
    "xkcd",
    "\"Never have I felt so close to another soul\\nAnd yet so helplessly alone\\nAs when I Google an error\\nAnd there's one result\\nA thread by someone with the same problem\\nAnd no answer\\nLast posted to in 2003\\n\\n\\\"Who were you, DenverCoder9?\\\"\\n\\\"What did you see?!\\\"\\n\\n(ref: https://xkcd.com/979/)\")\r"
  ],
  ["A developer", "\"No hugs & kisses.\\nOnly bugs & fixes.\")\r"],
  [
    "Elon Musk",
    "\"Don't set your password as your child's name.\\nName your child after your password.\")\r"
  ],
  ["OOP", "\"If you want to treat women as objects,\\ndo it with class.\"\r"],
  ["Internet #404", "\"Quote not Found\"\r"],
  [
    "Mary Oliver",
    "\"Someone I loved once gave me a box full of darkness.\\nIt took me years to understand that this, too, was a gift.\"\r"
  ],
  ["Floor", "\"If you fall, I will be there.\"\r"],
  [
    "Simon Amstell",
    "\"If you have some problem in your life and need to deal with it, then use religion, that's fine.\\nI use Google.\"\r"
  ],
  [
    "Albert Einstein",
    "\"Only 3 things are infinite:\\n1. Universe.\\n2. Human Stupidity.\\n3. Winrar's free trial.\"\r"
  ],
  [
    "Terry Pratchett",
    "\"Artificial Intelligence is no match for natural stupidity.\"\r"
  ],
  [
    "Stewart Brand",
    "\"Once a new technology starts rolling, if you're not part of the steamroller,\\nyou're part of the road.\"\r"
  ],
  [
    "Sam Redwine",
    "\"Software and cathedrals are much the same - first we build them, then we pray.\"\r"
  ],
  [
    "Jan L. A. van de Snepscheut",
    "\"In theory, there is no difference between theory and practice. But, in practice, there is.\"\r"
  ],
  [
    "Jessica Gaston",
    "\"One man's crappy software is another man's full time job.\"\r"
  ],
  [
    "Raymond Devos",
    "\"Mon pied droit est jaloux de mon pied gauche. Quand l'un avance, l'autre veut le dépasser.\\nEt moi, comme un imbécile, je marche !\"\r"
  ],
  [
    "Gandhi",
    "\"Earth provides enough to satisfy every man's need, but not every man's greed.\"\r"
  ],
  [
    "R. D. Laing",
    "\"Life is a sexually transmitted disease and the mortality rate is one hundred percent.\"\r"
  ],
  [
    "Hustle Man",
    "\"Politicians are like sperm.\\nOne in a million turn out to be an actual human being.\"\r"
  ],
  [
    "Mark Twain",
    "\"Censorship is telling a man he can't have a steak just because a baby can't chew it.\"\r"
  ],
  [
    "Friedrich Nietzsche",
    "\"There is not enough love and goodness in the world to permit giving any of it away to imaginary beings.\"\r"
  ],
  ["Dhalsim", "\"Pain is a state of mind and I don't mind your pain.\"\r"],
  [
    "Elie Wiesel",
    "\"Human beings can be beautiful or more beautiful,\\nthey can be fat or skinny, they can be right or wrong,\\nbut illegal? How can a human being be illegal?\"\r"
  ],
  [
    "Dennis Ritchie",
    "\"Empty your memory, with a free(), like a pointer.\\nIf you cast a pointer to a integer, it becomes the integer.\\nIf you cast a pointer to a struct, it becomes the struct.\\nThe pointer can crash, and can overflow.\\nBe a pointer my friend.\"\r"
  ],
  [
    "Chewbacca",
    "\"Uuuuuuuuuur Ahhhhrrrrrr\\nUhrrrr Ahhhhrrrrrr\\nAaaarhg...\"\r"
  ],
  [
    "Alexandria Ocasio-Cortez",
    "\"No one ever makes a billion dollars.\\nYou TAKE a billion dollars.\"\r"
  ],
  ["Freddy Krueger", "\"Never stop dreaming.\\n\"\r"],
  [
    "Ricky Gervais",
    "\"Feel free to mock my lack of belief in any Gods.\\nIt won't hurt my feelings.\\nIt won't damage my faith in reason.\\nAnd I won't kill you for it.\"\r"
  ],
  [
    "Francis bacon",
    "\"Knowledge is power. France is bacon.\\n\\nWhen I was young my father said to me: \\\"Knowledge is power, Francis Bacon.\\\" I understood it as \\\"Knowledge is power, France is bacon.\\\"\\n\\nFor more than a decade I wondered over the meaning of the second part and what was the surreal linkage between the two. If I said the quote to someone, \\\"Knowledge is power, France is Bacon\\\", they nodded knowingly. Or someone might say, \\\"Knowledge is power\\\" and I'd finish the quote \\\"France is Bacon\\\" and they wouldn't look at me like I'd said something very odd, but thoughtfully agree. I did ask a teacher what did \\\"Knowledge is power, France is bacon\\\" mean and got a full 10-minute explanation of the \\\"knowledge is power\\\" bit but nothing on \\\"France is bacon\\\". When I prompted further explanation by saying \\\"France is bacon?\\\" in a questioning tone I just got a \\\"yes\\\". At 12 I didn't have the confidence to press it further. I just accepted it as something I'd never understand.\\n\\nIt wasn't until years later I saw it written down that the penny dropped.\\n\"\r"
  ],
  [
    "Space Invaders",
    "\"\\n\\n       ▄██▄\\n     ▄██████▄           █   █  █▀▀▀\\n     ██▄██▄██           █   █  █▄▄\\n      ▄▀▄▄▀▄            █ █ █  █\\n     ▀ ▀  ▀ ▀           ▀▀ ▀▀  ▀▀▀▀\\n\\n      ▀▄   ▄▀           ▄█▀▀▀  ▄█▀▀█▄  █▀▄▀█  █▀▀▀\\n     ▄█▀███▀█▄          █      █    █  █ ▀ █  █▄▄\\n    █ █▀▀▀▀▀█ █         █▄     █▄  ▄█  █   █  █\\n       ▀▀ ▀▀             ▀▀▀▀   ▀▀▀▀   ▀   ▀  ▀▀▀▀\\n\\n     ▄▄█████▄▄          ▀█▀  █▀▄  █\\n    ██▀▀███▀▀██          █   █ ▀▄ █\\n    ▀▀██▀▀▀██▀▀          █   █  ▀▄█\\n    ▄█▀ ▀▀▀ ▀█▄         ▀▀▀  ▀   ▀▀\\n\\n      ▄▄████▄▄          █▀▀█  █▀▀▀  ▄▀▀▄  ▄█▀▀▀  █▀▀▀\\n    ▄██████████▄        █▄▄█  █▄▄   █▄▄█  █      █▄▄ \\n  ▄██▄██▄██▄██▄██▄      █     █     █  █  █▄     █   \\n    ▀█▀  ▀▀  ▀█▀        ▀     ▀▀▀▀  ▀  ▀   ▀▀▀▀  ▀▀▀▀\\n\\n\")\r"
  ],
  [
    "#JeSuisCharlie",
    "\"Freedom of expression is like the air we breathe, we don't feel it, until people take it away from us.\\n\\nFor this reason, Je suis Charlie, not because I endorse everything they published, but because I cherish the right to speak out freely without risk even when it offends others.\\nAnd no, you cannot just take someone's life for whatever he/she expressed.\\n\\nHence this \\\"Je suis Charlie\\\" edition.\\n\r"
  ],
  [""]
]
